python/cookbook.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en-US" xml:lang="en-US">
<head>
<!-- 2019-02-04 Mon 11:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Python Cookbook</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="chrischen" />
<meta name="keywords" content="python, cookbook" />
<link rel="stylesheet" type="text/css" href="../styles/demo/css/demo.css"/>
<link href="https://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Python Cookbook</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge2548cd">1. Data Structures and Algorithms</a></li>
<li><a href="#orge99867b">2. String Manipulation</a></li>
<li><a href="#orgbe4c978">3. Numbers</a></li>
<li><a href="#orgd44ee8e">4. Datetime</a></li>
<li><a href="#orgd31aa21">5. Iterator</a></li>
</ul>
</div>
</div>
<div id="outline-container-orge2548cd" class="outline-2">
<h2 id="orge2548cd"><span class="section-number-2">1</span> Data Structures and Algorithms</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgf71d245" class="outline-3">
<h3 id="orgf71d245"><span class="section-number-3">1.1</span> Unpacking from Iterables</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-python">x, *<span style="color: #715ab1;">middle</span>, <span style="color: #715ab1;">y</span> = <span style="color: #3a81c3;">[</span><span style="color: #4e3163;">1</span>, <span style="color: #4e3163;">2</span>, <span style="color: #4e3163;">3</span>, <span style="color: #4e3163;">4</span>, <span style="color: #4e3163;">5</span><span style="color: #3a81c3;">]</span> <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">middle can be replaced by placeholder '_'</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">x =&gt; 1</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">y =&gt; 5</span>

<span style="color: #715ab1;">data</span> = <span style="color: #3a81c3;">[</span><span style="color: #2d9574;">'ACME'</span>, <span style="color: #4e3163;">50</span>, <span style="color: #4e3163;">91</span>.<span style="color: #4e3163;">1</span>, <span style="color: #6c3163;">(</span><span style="color: #4e3163;">2012</span>, <span style="color: #4e3163;">12</span>, <span style="color: #4e3163;">21</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">]</span>
name, shares, price, <span style="color: #3a81c3;">(</span>year, mon, day<span style="color: #3a81c3;">)</span> = data
</pre>
</div>
</div>
</div>

<div id="outline-container-orgace891f" class="outline-3">
<h3 id="orgace891f"><span class="section-number-3">1.2</span> Keeping the Last N Items</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">from</span> collections <span style="color: #3a81c3; font-weight: bold;">import</span> deque
<span style="color: #715ab1;">d</span>=deque<span style="color: #3a81c3;">(</span>maxlen=N<span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org02fd56f" class="outline-3">
<h3 id="org02fd56f"><span class="section-number-3">1.3</span> Finding the Largest N Items</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">import</span> heapq
heapq.nlargest<span style="color: #3a81c3;">(</span>N, items<span style="color: #3a81c3;">)</span>
heapq.nsmallest<span style="color: #3a81c3;">(</span>N, items<span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">heapq.nlargest(N, data, key=lambda function)</span>
</pre>
</div>
<p>
Underneath the covers, they work by first converting the data into a list
where items are ordered as a heap.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">nums</span> = <span style="color: #3a81c3;">[</span><span style="color: #4e3163;">1</span>, <span style="color: #4e3163;">8</span>, <span style="color: #4e3163;">2</span>, <span style="color: #4e3163;">23</span>, <span style="color: #4e3163;">7</span>, -<span style="color: #4e3163;">4</span>, <span style="color: #4e3163;">18</span>, <span style="color: #4e3163;">23</span>, <span style="color: #4e3163;">42</span>, <span style="color: #4e3163;">37</span>, <span style="color: #4e3163;">2</span><span style="color: #3a81c3;">]</span>
heapq.heapify<span style="color: #3a81c3;">(</span>nums<span style="color: #3a81c3;">)</span> <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">inplace function</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">nums =&gt; [-4, 2, 1, 23, 7, 2, 18, 23, 42, 37, 8] heap[0] is the smallest</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org4038552" class="outline-3">
<h3 id="org4038552"><span class="section-number-3">1.4</span> PriorityQueue Implemention</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">import</span> heapq

<span style="color: #3a81c3; font-weight: bold;">class</span> <span style="color: #ba2f59; font-weight: bold;">PriorityQueue</span>:
    <span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">__init__</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">self</span><span style="color: #3a81c3;">)</span>:
        <span style="color: #3a81c3; font-weight: bold;">self</span>._queue = <span style="color: #3a81c3;">[]</span>
        <span style="color: #3a81c3; font-weight: bold;">self</span>._index = <span style="color: #4e3163;">0</span> <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">use index to properly order items with the same priority level</span>

    <span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">push</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">self</span>, item, priority<span style="color: #3a81c3;">)</span>:
        heapq.heappush<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">self</span>._queue, <span style="color: #6c3163;">(</span>-priority, <span style="color: #3a81c3; font-weight: bold;">self</span>._index, item<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
        <span style="color: #3a81c3; font-weight: bold;">self</span>._index += <span style="color: #4e3163;">1</span>

    <span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">pop</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">self</span><span style="color: #3a81c3;">)</span>:
        <span style="color: #3a81c3; font-weight: bold;">return</span> heapq.heappop<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">self</span>._queue<span style="color: #3a81c3;">)[</span>-<span style="color: #4e3163;">1</span><span style="color: #3a81c3;">]</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org4bc5bc4" class="outline-3">
<h3 id="org4bc5bc4"><span class="section-number-3">1.5</span> defaultdict</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">from</span> collections <span style="color: #3a81c3; font-weight: bold;">import</span> defaultdict
<span style="color: #715ab1;">d</span> = defaultdict<span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">list</span><span style="color: #3a81c3;">)</span>
d<span style="color: #3a81c3;">[</span><span style="color: #2d9574;">'a'</span><span style="color: #3a81c3;">]</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">=&gt; []</span>
</pre>
</div>
<p>
<b>defaultdict</b> will automatically create dictionary entries for keys accessed later on, alternative:
</p>
<div class="org-src-container">
<pre class="src src-python">d.setdefault<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'a'</span>, <span style="color: #6c3163;">[]</span><span style="color: #3a81c3;">)</span>.append<span style="color: #3a81c3;">(</span><span style="color: #4e3163;">1</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
<div id="outline-container-org319c40c" class="outline-4">
<h4 id="org319c40c"><span class="section-number-4">1.5.1</span> alternative</h4>
<div class="outline-text-4" id="text-1-5-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">d</span> = <span style="color: #3a81c3;">{}</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">A regular dictionary</span>
d.setdefault<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'a'</span>, <span style="color: #6c3163;">[]</span><span style="color: #3a81c3;">)</span>.append<span style="color: #3a81c3;">(</span><span style="color: #4e3163;">1</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org7e95d36" class="outline-3">
<h3 id="org7e95d36"><span class="section-number-3">1.6</span> OrderedDict</h3>
<div class="outline-text-3" id="text-1-6">
<p>
An OrderedDict internally maintains a doubly linked list that orders the keys according to insertion order.
</p>
</div>
</div>

<div id="outline-container-org1deaa57" class="outline-3">
<h3 id="org1deaa57"><span class="section-number-3">1.7</span> sortedcontainers</h3>
<div class="outline-text-3" id="text-1-7">
<p>
SortedList, SortedDict, SortedSet
</p>
</div>
</div>

<div id="outline-container-org938ed68" class="outline-3">
<h3 id="org938ed68"><span class="section-number-3">1.8</span> Calculating with Dictionaries</h3>
<div class="outline-text-3" id="text-1-8">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">prices</span> = <span style="color: #3a81c3;">{</span>
    <span style="color: #2d9574;">'ACME'</span>: <span style="color: #4e3163;">45</span>.<span style="color: #4e3163;">23</span>,
    <span style="color: #2d9574;">'AAPL'</span>: <span style="color: #4e3163;">612</span>.<span style="color: #4e3163;">78</span>,
    <span style="color: #2d9574;">'IBM'</span>: <span style="color: #4e3163;">205</span>.<span style="color: #4e3163;">55</span>,
    <span style="color: #2d9574;">'HPQ'</span>: <span style="color: #4e3163;">37</span>.<span style="color: #4e3163;">20</span>,
    <span style="color: #2d9574;">'FB'</span>: <span style="color: #4e3163;">10</span>.<span style="color: #4e3163;">75</span>
<span style="color: #3a81c3;">}</span>
<span style="color: #715ab1;">min_price</span> = <span style="color: #3a81c3;">min</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">zip</span><span style="color: #6c3163;">(</span>prices.values<span style="color: #2d9574;">()</span>, prices.keys<span style="color: #2d9574;">()</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span> <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">zip to ((value, key)) generator</span>

<span style="color: #3a81c3;">min</span><span style="color: #3a81c3;">(</span>prices, key=<span style="color: #3a81c3; font-weight: bold;">lambda</span> k: prices<span style="color: #6c3163;">[</span>k<span style="color: #6c3163;">]</span><span style="color: #3a81c3;">)</span> <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Returns 'FB'</span>
<span style="color: #715ab1;">min_value</span> = prices<span style="color: #3a81c3;">[</span><span style="color: #3a81c3;">min</span><span style="color: #6c3163;">(</span>prices, key=<span style="color: #3a81c3; font-weight: bold;">lambda</span> k: prices<span style="color: #2d9574;">[</span>k<span style="color: #2d9574;">]</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">]</span>
</pre>
</div>
</div>
</div>
