org/python/cookbook.org
** keys-view
   #+BEGIN_SRC python
     a.keys() & b.keys()
     a.keys() - {'z', 'w'} # {'z', 'w'} is a set
   #+END_SRC

** Naming a Slice
   #+BEGIN_SRC python
     a = [1,2,3,4,5]
     b = slice(1,2)

     a[b] #=> [2] slower than a[1]
   #+END_SRC

** Counting
   #+BEGIN_SRC python
     from collections import Counter
     word_counts1 = Counter(words1)
     word_counts2 = Counter(words2)
     word_counts1 + word_counts2
   #+END_SRC

** Sorting a List of Dictionaries
   #+BEGIN_SRC python
     from operator import itemgetter
     rows_by_fname = sorted(rows, key=itemgetter('fname'))
     rows_by_lfname = sorted(rows, key=itemgetter('lname','fname'))

     g = itemgetter(2, 5, 3) # the call g(r) returns (r[2], r[5], r[3])
   #+END_SRC

** Sorting Objects Without Native Comparison
   #+BEGIN_SRC python
     sorted(users, key=lambda u: u.user_id)
     from operator import attrgetter
     sorted(users, key=attrgetter('user_id'))
     by_name = sorted(users, key=attrgetter('last_name', 'first_name'))
   #+END_SRC

** groupby
   Since =groupby()= only examines consecutive items, should sort the groupby key first.
   #+BEGIN_SRC python
     from itertools import groupby
     rows.sort(key=itemgetter('date'))
     for date, items in groupby(rows, key=itemgetter('date')):
         pass
     # alternative if memory is no concern, and faster than sort+groupby
     rows_by_date = defaultdict(list)
     for row in rows:
         rows_by_date[row['date']].append(row)
   #+END_SRC
** itertools.compress
   Like boolean index in pandas. Takes an iterable and an accompanying Boolean selector sequence as input.
   =list(compress(data, mask))=

** namedtuple&namedlist
   optional or missing fields
   #+BEGIN_SRC python
     Stock = namedtuple('Stock', ['name', 'shares', 'price', 'date', 'time'])
     stock_prototype = Stock('', 0, 0.0, None, None)
     def dict_to_stock(s):
         return stock_prototype._replace(**s)
   #+END_SRC

** sum, min,...
   #+BEGIN_SRC python
     s = sum((x * x for x in nums))
     s = sum(x * x for x in nums) # same as above

     # Original: Returns 20
     min_shares = min(s['shares'] for s in portfolio)
     # Alternative: Returns {'name': 'AOL', 'shares': 20}
     min_shares = min(portfolio, key=lambda s: s['shares'])
   #+END_SRC

** ChainMap
   A ChainMap takes multiple mappings and makes them logically appear as one. If there are duplicate keys,
   the values from the first mapping get used.
   #+BEGIN_SRC python
     from collections import ChainMap
     c = ChainMap(a,b)
     # alternative
     c = b
     c.update(a)
   #+END_SRC
   - but ChainMap keep the reference of a&b

