python/cookbook.html

<div id="outline-container-orga0dcc56" class="outline-3">
<h3 id="orga0dcc56"><span class="section-number-3">1.9</span> keys-view</h3>
<div class="outline-text-3" id="text-1-9">
<div class="org-src-container">
<pre class="src src-python">a.keys<span style="color: #3a81c3;">()</span> &amp; b.keys<span style="color: #3a81c3;">()</span>
a.keys<span style="color: #3a81c3;">()</span> - <span style="color: #3a81c3;">{</span><span style="color: #2d9574;">'z'</span>, <span style="color: #2d9574;">'w'</span><span style="color: #3a81c3;">}</span> <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">{'z', 'w'} is a set</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8b00396" class="outline-3">
<h3 id="org8b00396"><span class="section-number-3">1.10</span> Naming a Slice</h3>
<div class="outline-text-3" id="text-1-10">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">a</span> = <span style="color: #3a81c3;">[</span><span style="color: #4e3163;">1</span>,<span style="color: #4e3163;">2</span>,<span style="color: #4e3163;">3</span>,<span style="color: #4e3163;">4</span>,<span style="color: #4e3163;">5</span><span style="color: #3a81c3;">]</span>
<span style="color: #715ab1;">b</span> = <span style="color: #3a81c3;">slice</span><span style="color: #3a81c3;">(</span><span style="color: #4e3163;">1</span>,<span style="color: #4e3163;">2</span><span style="color: #3a81c3;">)</span>

a<span style="color: #3a81c3;">[</span>b<span style="color: #3a81c3;">]</span> <span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">=&gt; [2] slower than a[1]</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6b559d6" class="outline-3">
<h3 id="org6b559d6"><span class="section-number-3">1.11</span> Counting</h3>
<div class="outline-text-3" id="text-1-11">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">from</span> collections <span style="color: #3a81c3; font-weight: bold;">import</span> Counter
<span style="color: #715ab1;">word_counts1</span> = Counter<span style="color: #3a81c3;">(</span>words1<span style="color: #3a81c3;">)</span>
<span style="color: #715ab1;">word_counts2</span> = Counter<span style="color: #3a81c3;">(</span>words2<span style="color: #3a81c3;">)</span>
word_counts1 + word_counts2
</pre>
</div>
</div>
</div>

<div id="outline-container-orgad40e7f" class="outline-3">
<h3 id="orgad40e7f"><span class="section-number-3">1.12</span> Sorting a List of Dictionaries</h3>
<div class="outline-text-3" id="text-1-12">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">from</span> operator <span style="color: #3a81c3; font-weight: bold;">import</span> itemgetter
<span style="color: #715ab1;">rows_by_fname</span> = <span style="color: #3a81c3;">sorted</span><span style="color: #3a81c3;">(</span>rows, key=itemgetter<span style="color: #6c3163;">(</span><span style="color: #2d9574;">'fname'</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #715ab1;">rows_by_lfname</span> = <span style="color: #3a81c3;">sorted</span><span style="color: #3a81c3;">(</span>rows, key=itemgetter<span style="color: #6c3163;">(</span><span style="color: #2d9574;">'lname'</span>,<span style="color: #2d9574;">'fname'</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #715ab1;">g</span> = itemgetter<span style="color: #3a81c3;">(</span><span style="color: #4e3163;">2</span>, <span style="color: #4e3163;">5</span>, <span style="color: #4e3163;">3</span><span style="color: #3a81c3;">)</span> <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">the call g(r) returns (r[2], r[5], r[3])</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org86bd333" class="outline-3">
<h3 id="org86bd333"><span class="section-number-3">1.13</span> Sorting Objects Without Native Comparison</h3>
<div class="outline-text-3" id="text-1-13">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3;">sorted</span><span style="color: #3a81c3;">(</span>users, key=<span style="color: #3a81c3; font-weight: bold;">lambda</span> u: u.user_id<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3; font-weight: bold;">from</span> operator <span style="color: #3a81c3; font-weight: bold;">import</span> attrgetter
<span style="color: #3a81c3;">sorted</span><span style="color: #3a81c3;">(</span>users, key=attrgetter<span style="color: #6c3163;">(</span><span style="color: #2d9574;">'user_id'</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #715ab1;">by_name</span> = <span style="color: #3a81c3;">sorted</span><span style="color: #3a81c3;">(</span>users, key=attrgetter<span style="color: #6c3163;">(</span><span style="color: #2d9574;">'last_name'</span>, <span style="color: #2d9574;">'first_name'</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbe82da8" class="outline-3">
<h3 id="orgbe82da8"><span class="section-number-3">1.14</span> groupby</h3>
<div class="outline-text-3" id="text-1-14">
<p>
Since <code>groupby()</code> only examines consecutive items, should sort the groupby key first.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">from</span> itertools <span style="color: #3a81c3; font-weight: bold;">import</span> groupby
rows.sort<span style="color: #3a81c3;">(</span>key=itemgetter<span style="color: #6c3163;">(</span><span style="color: #2d9574;">'date'</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3; font-weight: bold;">for</span> date, items <span style="color: #3a81c3; font-weight: bold;">in</span> groupby<span style="color: #3a81c3;">(</span>rows, key=itemgetter<span style="color: #6c3163;">(</span><span style="color: #2d9574;">'date'</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>:
    <span style="color: #3a81c3; font-weight: bold;">pass</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">alternative if memory is no concern, and faster than sort+groupby</span>
<span style="color: #715ab1;">rows_by_date</span> = defaultdict<span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">list</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3; font-weight: bold;">for</span> row <span style="color: #3a81c3; font-weight: bold;">in</span> rows:
    rows_by_date<span style="color: #3a81c3;">[</span>row<span style="color: #6c3163;">[</span><span style="color: #2d9574;">'date'</span><span style="color: #6c3163;">]</span><span style="color: #3a81c3;">]</span>.append<span style="color: #3a81c3;">(</span>row<span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org6f549ff" class="outline-3">
<h3 id="org6f549ff"><span class="section-number-3">1.15</span> itertools.compress</h3>
<div class="outline-text-3" id="text-1-15">
<p>
Like boolean index in pandas. Takes an iterable and an accompanying Boolean selector sequence as input.
<code>list(compress(data, mask))</code>
</p>
</div>
</div>

<div id="outline-container-org72f4bc8" class="outline-3">
<h3 id="org72f4bc8"><span class="section-number-3">1.16</span> namedtuple&amp;namedlist</h3>
<div class="outline-text-3" id="text-1-16">
<p>
optional or missing fields
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">Stock</span> = namedtuple<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'Stock'</span>, <span style="color: #6c3163;">[</span><span style="color: #2d9574;">'name'</span>, <span style="color: #2d9574;">'shares'</span>, <span style="color: #2d9574;">'price'</span>, <span style="color: #2d9574;">'date'</span>, <span style="color: #2d9574;">'time'</span><span style="color: #6c3163;">]</span><span style="color: #3a81c3;">)</span>
<span style="color: #715ab1;">stock_prototype</span> = Stock<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">''</span>, <span style="color: #4e3163;">0</span>, <span style="color: #4e3163;">0</span>.<span style="color: #4e3163;">0</span>, <span style="color: #4e3163;">None</span>, <span style="color: #4e3163;">None</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">dict_to_stock</span><span style="color: #3a81c3;">(</span>s<span style="color: #3a81c3;">)</span>:
    <span style="color: #3a81c3; font-weight: bold;">return</span> stock_prototype._replace<span style="color: #3a81c3;">(</span>**s<span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org33ecd7b" class="outline-3">
<h3 id="org33ecd7b"><span class="section-number-3">1.17</span> sum, min,&#x2026;</h3>
<div class="outline-text-3" id="text-1-17">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">s</span> = <span style="color: #3a81c3;">sum</span><span style="color: #3a81c3;">(</span><span style="color: #6c3163;">(</span>x * x <span style="color: #3a81c3; font-weight: bold;">for</span> x <span style="color: #3a81c3; font-weight: bold;">in</span> nums<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #715ab1;">s</span> = <span style="color: #3a81c3;">sum</span><span style="color: #3a81c3;">(</span>x * x <span style="color: #3a81c3; font-weight: bold;">for</span> x <span style="color: #3a81c3; font-weight: bold;">in</span> nums<span style="color: #3a81c3;">)</span> <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">same as above</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Original: Returns 20</span>
<span style="color: #715ab1;">min_shares</span> = <span style="color: #3a81c3;">min</span><span style="color: #3a81c3;">(</span>s<span style="color: #6c3163;">[</span><span style="color: #2d9574;">'shares'</span><span style="color: #6c3163;">]</span> <span style="color: #3a81c3; font-weight: bold;">for</span> s <span style="color: #3a81c3; font-weight: bold;">in</span> portfolio<span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Alternative: Returns {'name': 'AOL', 'shares': 20}</span>
<span style="color: #715ab1;">min_shares</span> = <span style="color: #3a81c3;">min</span><span style="color: #3a81c3;">(</span>portfolio, key=<span style="color: #3a81c3; font-weight: bold;">lambda</span> s: s<span style="color: #6c3163;">[</span><span style="color: #2d9574;">'shares'</span><span style="color: #6c3163;">]</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgec4853a" class="outline-3">
<h3 id="orgec4853a"><span class="section-number-3">1.18</span> ChainMap</h3>
<div class="outline-text-3" id="text-1-18">
<p>
A ChainMap takes multiple mappings and makes them logically appear as one. If there are duplicate keys,
the values from the first mapping get used.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">from</span> collections <span style="color: #3a81c3; font-weight: bold;">import</span> ChainMap
<span style="color: #715ab1;">c</span> = ChainMap<span style="color: #3a81c3;">(</span>a,b<span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">alternative</span>
<span style="color: #715ab1;">c</span> = b
c.update<span style="color: #3a81c3;">(</span>a<span style="color: #3a81c3;">)</span>
</pre>
</div>
<ul class="org-ul">
<li>but ChainMap keep the reference of a&amp;b</li>
</ul>
</div>
