org/python/cookbook.org
*** store scoped values
   A ChainMap is particularly useful when working with scoped values such as variables in
   a programming language (i.e., globals, locals, etc.)
   #+BEGIN_SRC python
     values = ChainMap()
     values['x'] = 1
     values = values.new_child()
     values['x'] = 2
     values['x'] #=> 2
     values = values.parents
     values['x'] #=> 1
   #+END_SRC
* String Manipulation
** modules
   - *fnmatch*: Filename matching with shell patterns.
   - *glob*: Filename globbing utility.

** re
*** find
    - =match()=
    - =findall()=
    - =finditer()=
    - =scaner()=

*** replace
    - =sub=

*** regex
    - named capture group: =r'?P<TOKENNAME>[a-zA-Z]+'=
    - noncapture

*** tokenize
**** Problem
     You have a string that you want to parse left to right into a stream of tokens.
**** Usage
    #+BEGIN_SRC python
      from collections import namedtuple
      Token = namedtuple('Token', ['type', 'value'])


      def generate_tokens(pat, text):
          scanner = pat.scanner(text)
          for m in iter(scanner.match, None):
              yield Token(m.lastgroup, m.group())


      # Example use
      for tok in generate_tokens(master_pat, 'foo = 42'):
          print(tok)

      # Produces output
      # Token(type='NAME', value='foo')
      # Token(type='WS', value=' ')
      # Token(type='EQ', value='=')
      # Token(type='WS', value=' ')
      # Token(type='NUM', value='42')
    #+END_SRC
    =scanner()= method of pattern objects. This method creates a scanner object in which repeated calls to match() step through the
    supplied text one match at a time

*** syntax parser
    - PyParsing
    - PLY
    - Recipe: 2.19

** format
*** align
    #+BEGIN_SRC python
      format('right', '>20')
      # '               right'
      format('right', '=>20')
      # '===============right'
    #+END_SRC

*** safesub
    #+BEGIN_SRC python
      class safesub(dict):
          def __missing__(self, key):
              return '{' + key + '}'

      name = 'ABC'
      n = 5
      s = '{name} has {n} messages.'
      s.format_map(safesub(vars()))
      # 'ABC has 5 messages.'
    #+END_SRC
**** frame hack
     #+BEGIN_SRC python
       def sub(text):
           return text.format_map(safesub(sys._getframe(1).f_locals))
     #+END_SRC

*** textwrap
    The textwrap module is a straightforward way to clean up text for printing.
    =textwrap.fill()= reformat text for output.

** join
   - ='abc' + ',' + 'def'=
   - ='abc' ',' 'def'=
   - =','.join(('abc', 'def'))=
   - ='{},{}'.format('abc', 'def')=
   - print('abc', 'def', sep=',')

