python/cookbook.html

<div id="outline-container-org181d4a9" class="outline-4">
<h4 id="org181d4a9"><span class="section-number-4">1.18.1</span> store scoped values</h4>
<div class="outline-text-4" id="text-1-18-1">
<p>
A ChainMap is particularly useful when working with scoped values such as variables in
a programming language (i.e., globals, locals, etc.)
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">values</span> = ChainMap<span style="color: #3a81c3;">()</span>
<span style="color: #715ab1;">values</span><span style="color: #3a81c3;">[</span><span style="color: #2d9574;">'x'</span><span style="color: #3a81c3;">]</span> = <span style="color: #4e3163;">1</span>
<span style="color: #715ab1;">values</span> = values.new_child<span style="color: #3a81c3;">()</span>
<span style="color: #715ab1;">values</span><span style="color: #3a81c3;">[</span><span style="color: #2d9574;">'x'</span><span style="color: #3a81c3;">]</span> = <span style="color: #4e3163;">2</span>
values<span style="color: #3a81c3;">[</span><span style="color: #2d9574;">'x'</span><span style="color: #3a81c3;">]</span> <span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">=&gt; 2</span>
<span style="color: #715ab1;">values</span> = values.parents
values<span style="color: #3a81c3;">[</span><span style="color: #2d9574;">'x'</span><span style="color: #3a81c3;">]</span> <span style="color: #2aa1ae; background-color: #ecf3ec;">#</span><span style="color: #2aa1ae; background-color: #ecf3ec;">=&gt; 1</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-orge99867b" class="outline-2">
<h2 id="orge99867b"><span class="section-number-2">2</span> String Manipulation</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org251eb1d" class="outline-3">
<h3 id="org251eb1d"><span class="section-number-3">2.1</span> modules</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li><b>fnmatch</b>: Filename matching with shell patterns.</li>
<li><b>glob</b>: Filename globbing utility.</li>
</ul>
</div>
</div>

<div id="outline-container-orgc26d23f" class="outline-3">
<h3 id="orgc26d23f"><span class="section-number-3">2.2</span> re</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-org4b923ac" class="outline-4">
<h4 id="org4b923ac"><span class="section-number-4">2.2.1</span> find</h4>
<div class="outline-text-4" id="text-2-2-1">
<ul class="org-ul">
<li><code>match()</code></li>
<li><code>findall()</code></li>
<li><code>finditer()</code></li>
<li><code>scaner()</code></li>
</ul>
</div>
</div>

<div id="outline-container-org45f3f63" class="outline-4">
<h4 id="org45f3f63"><span class="section-number-4">2.2.2</span> replace</h4>
<div class="outline-text-4" id="text-2-2-2">
<ul class="org-ul">
<li><code>sub</code></li>
</ul>
</div>
</div>

<div id="outline-container-org572d4c1" class="outline-4">
<h4 id="org572d4c1"><span class="section-number-4">2.2.3</span> regex</h4>
<div class="outline-text-4" id="text-2-2-3">
<ul class="org-ul">
<li>named capture group: <code>r'?P&lt;TOKENNAME&gt;[a-zA-Z]+'</code></li>
<li>noncapture</li>
</ul>
</div>
</div>

<div id="outline-container-org8fed2d6" class="outline-4">
<h4 id="org8fed2d6"><span class="section-number-4">2.2.4</span> tokenize</h4>
<div class="outline-text-4" id="text-2-2-4">
</div>
<ul class="org-ul">
<li><a id="org8aae85e"></a>Problem<br />
<div class="outline-text-5" id="text-org8aae85e">
<p>
You have a string that you want to parse left to right into a stream of tokens.
</p>
</div>
</li>
<li><a id="orgf847127"></a>Usage<br />
<div class="outline-text-5" id="text-orgf847127">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">from</span> collections <span style="color: #3a81c3; font-weight: bold;">import</span> namedtuple
<span style="color: #715ab1;">Token</span> = namedtuple<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'Token'</span>, <span style="color: #6c3163;">[</span><span style="color: #2d9574;">'type'</span>, <span style="color: #2d9574;">'value'</span><span style="color: #6c3163;">]</span><span style="color: #3a81c3;">)</span>


<span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">generate_tokens</span><span style="color: #3a81c3;">(</span>pat, text<span style="color: #3a81c3;">)</span>:
    <span style="color: #715ab1;">scanner</span> = pat.scanner<span style="color: #3a81c3;">(</span>text<span style="color: #3a81c3;">)</span>
    <span style="color: #3a81c3; font-weight: bold;">for</span> m <span style="color: #3a81c3; font-weight: bold;">in</span> <span style="color: #3a81c3;">iter</span><span style="color: #3a81c3;">(</span>scanner.match, <span style="color: #4e3163;">None</span><span style="color: #3a81c3;">)</span>:
        <span style="color: #3a81c3; font-weight: bold;">yield</span> Token<span style="color: #3a81c3;">(</span>m.lastgroup, m.group<span style="color: #6c3163;">()</span><span style="color: #3a81c3;">)</span>


<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Example use</span>
<span style="color: #3a81c3; font-weight: bold;">for</span> tok <span style="color: #3a81c3; font-weight: bold;">in</span> generate_tokens<span style="color: #3a81c3;">(</span>master_pat, <span style="color: #2d9574;">'foo = 42'</span><span style="color: #3a81c3;">)</span>:
    <span style="color: #3a81c3; font-weight: bold;">print</span><span style="color: #3a81c3;">(</span>tok<span style="color: #3a81c3;">)</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Produces output</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Token(type='NAME', value='foo')</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Token(type='WS', value=' ')</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Token(type='EQ', value='=')</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Token(type='WS', value=' ')</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Token(type='NUM', value='42')</span>
</pre>
</div>
<p>
<code>scanner()</code> method of pattern objects. This method creates a scanner object in which repeated calls to match() step through the
supplied text one match at a time
</p>
</div>
</li>
</ul>
</div>

<div id="outline-container-org5a2fdb3" class="outline-4">
<h4 id="org5a2fdb3"><span class="section-number-4">2.2.5</span> syntax parser</h4>
<div class="outline-text-4" id="text-2-2-5">
<ul class="org-ul">
<li>PyParsing</li>
<li>PLY</li>
<li>Recipe: 2.19</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orge6b8fae" class="outline-3">
<h3 id="orge6b8fae"><span class="section-number-3">2.3</span> format</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-org0946704" class="outline-4">
<h4 id="org0946704"><span class="section-number-4">2.3.1</span> align</h4>
<div class="outline-text-4" id="text-2-3-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3;">format</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'right'</span>, <span style="color: #2d9574;">'&gt;20'</span><span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">'               right'</span>
<span style="color: #3a81c3;">format</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'right'</span>, <span style="color: #2d9574;">'=&gt;20'</span><span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">'===============right'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5d4e768" class="outline-4">
<h4 id="org5d4e768"><span class="section-number-4">2.3.2</span> safesub</h4>
<div class="outline-text-4" id="text-2-3-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">class</span> <span style="color: #ba2f59; font-weight: bold;">safesub</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">dict</span><span style="color: #3a81c3;">)</span>:
    <span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">__missing__</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">self</span>, key<span style="color: #3a81c3;">)</span>:
        <span style="color: #3a81c3; font-weight: bold;">return</span> <span style="color: #2d9574;">'{'</span> + key + <span style="color: #2d9574;">'}'</span>

<span style="color: #715ab1;">name</span> = <span style="color: #2d9574;">'ABC'</span>
<span style="color: #715ab1;">n</span> = <span style="color: #4e3163;">5</span>
<span style="color: #715ab1;">s</span> = <span style="color: #2d9574;">'{name} has {n} messages.'</span>
s.format_map<span style="color: #3a81c3;">(</span>safesub<span style="color: #6c3163;">(</span><span style="color: #3a81c3;">vars</span><span style="color: #2d9574;">()</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">'ABC has 5 messages.'</span>
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="org90c492f"></a>frame hack<br />
<div class="outline-text-5" id="text-org90c492f">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">sub</span><span style="color: #3a81c3;">(</span>text<span style="color: #3a81c3;">)</span>:
    <span style="color: #3a81c3; font-weight: bold;">return</span> text.format_map<span style="color: #3a81c3;">(</span>safesub<span style="color: #6c3163;">(</span>sys._getframe<span style="color: #2d9574;">(</span><span style="color: #4e3163;">1</span><span style="color: #2d9574;">)</span>.f_locals<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</li>
</ul>
</div>

<div id="outline-container-orgfd8df58" class="outline-4">
<h4 id="orgfd8df58"><span class="section-number-4">2.3.3</span> textwrap</h4>
<div class="outline-text-4" id="text-2-3-3">
<p>
The textwrap module is a straightforward way to clean up text for printing.
<code>textwrap.fill()</code> reformat text for output.
</p>
</div>
</div>
</div>

<div id="outline-container-org4c3948e" class="outline-3">
<h3 id="org4c3948e"><span class="section-number-3">2.4</span> join</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li><code>'abc' + ',' + 'def'</code></li>
<li><code>'abc' ',' 'def'</code></li>
<li><code>','.join(('abc', 'def'))</code></li>
<li><code>'{},{}'.format('abc', 'def')</code></li>
<li>print('abc', 'def', sep=',')</li>
</ul>
</div>
</div>
