org/python/cookbook.org
** combining I/O write operation
   #+BEGIN_SRC python
     def combine(source, maxsize):
         parts = []
         size = 0
         for part in source:
             parts.append(part)
             size += len(part)
             if size > maxsize:
                 yield ''.join(parts)
                 parts = []
                 size = 0
         yield ''.join(parts)

     for part in combine(sample(), 32768):
         f.write(part)
   #+END_SRC
   - Example: write to socket send buffer

** escape
   - =html.escape=
   - =xml.escape=

* Numbers
** round
   #+BEGIN_SRC python
     round(1.29, 1)
     # => 1.3
     round(1245, -1)
     # => 1240
     round(1275, -1)
     # => 1280
   #+END_SRC

** Decimal
   #+BEGIN_SRC python
     from decimal import Decimal, localcontext
     a = Decimal('6.32')
     b = Decimal('2.41')

     with localcontext() as ctx:
         ctx.prec = 5
         print(a/b) # 2.6224
   #+END_SRC

** Formatting
   #+BEGIN_SRC python
     x = 1234.56789
     format(x, '0.2f')
     # => '1234.57'   # round
     format(x, '>10.1f')
     # => '    1234.6'
     format(x, '0,.1f')
     # => '1,234.6

     x = 1234
     bin(x)  # others: oct, hex
     # => '0b10011010010'
     format(x, 'b')  # others: o, x
     # => '0011010010'
     int('10011010010', 2)
     # => 1234
   #+END_SRC

** bytes-int conversion
   #+BEGIN_SRC python
     data = b'\x00\x124V\x00x\x90\xab\x00\xcd\xef\x01\x00#\x004'
     x = int.from_bytes(data, 'little') # or 'big'
     x.to_bytes(16, 'little')
   #+END_SRC
   useful in cryptography or networking domains

** cmath for complex math
** fractions for fraction calculation
** random
   - =random.choice=
   - =random.sample=
   - =random.shuffle=
   - =random.randint=
   - =random.random=: 0 to 1
   - =random.getrandbits=
*** seed
    #+BEGIN_SRC python
      random.seed()  # Seed based on system time or os.urandom()
      random.seed(12345)  # Seed based on integer given
      random.seed(b'bytedata')  # Seed based on byte data
    #+END_SRC

*** distribution
    - =random.uniform=
    - =random.gauss=

** math.f***
   - =math.fsum=
   - =math.fmod=
   - =math.fabs=
* Datetime
** Finding Last Friday
   #+BEGIN_SRC python
     from dateutil.relativedelta import relativedelta
     from dateutil.rrule import FR
     d = datetime.now()
     print(d + relativedelta(weekday=FR(-1)))
   #+END_SRC

