python/cookbook.html

<div id="outline-container-orgf5c1375" class="outline-3">
<h3 id="orgf5c1375"><span class="section-number-3">2.5</span> combining I/O write operation</h3>
<div class="outline-text-3" id="text-2-5">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">def</span> <span style="color: #6c3163; font-weight: bold;">combine</span><span style="color: #3a81c3;">(</span>source, maxsize<span style="color: #3a81c3;">)</span>:
    <span style="color: #715ab1;">parts</span> = <span style="color: #3a81c3;">[]</span>
    <span style="color: #715ab1;">size</span> = <span style="color: #4e3163;">0</span>
    <span style="color: #3a81c3; font-weight: bold;">for</span> part <span style="color: #3a81c3; font-weight: bold;">in</span> source:
        parts.append<span style="color: #3a81c3;">(</span>part<span style="color: #3a81c3;">)</span>
        <span style="color: #715ab1;">size</span> += <span style="color: #3a81c3;">len</span><span style="color: #3a81c3;">(</span>part<span style="color: #3a81c3;">)</span>
        <span style="color: #3a81c3; font-weight: bold;">if</span> size &gt; maxsize:
            <span style="color: #3a81c3; font-weight: bold;">yield</span> <span style="color: #2d9574;">''</span>.join<span style="color: #3a81c3;">(</span>parts<span style="color: #3a81c3;">)</span>
            <span style="color: #715ab1;">parts</span> = <span style="color: #3a81c3;">[]</span>
            <span style="color: #715ab1;">size</span> = <span style="color: #4e3163;">0</span>
    <span style="color: #3a81c3; font-weight: bold;">yield</span> <span style="color: #2d9574;">''</span>.join<span style="color: #3a81c3;">(</span>parts<span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3; font-weight: bold;">for</span> part <span style="color: #3a81c3; font-weight: bold;">in</span> combine<span style="color: #3a81c3;">(</span>sample<span style="color: #6c3163;">()</span>, <span style="color: #4e3163;">32768</span><span style="color: #3a81c3;">)</span>:
    f.write<span style="color: #3a81c3;">(</span>part<span style="color: #3a81c3;">)</span>
</pre>
</div>
<ul class="org-ul">
<li>Example: write to socket send buffer</li>
</ul>
</div>
</div>

<div id="outline-container-org2c6edf1" class="outline-3">
<h3 id="org2c6edf1"><span class="section-number-3">2.6</span> escape</h3>
<div class="outline-text-3" id="text-2-6">
<ul class="org-ul">
<li><code>html.escape</code></li>
<li><code>xml.escape</code></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgbe4c978" class="outline-2">
<h2 id="orgbe4c978"><span class="section-number-2">3</span> Numbers</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgdc34b67" class="outline-3">
<h3 id="orgdc34b67"><span class="section-number-3">3.1</span> round</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3;">round</span><span style="color: #3a81c3;">(</span><span style="color: #4e3163;">1</span>.<span style="color: #4e3163;">29</span>, <span style="color: #4e3163;">1</span><span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">=&gt; 1.3</span>
<span style="color: #3a81c3;">round</span><span style="color: #3a81c3;">(</span><span style="color: #4e3163;">1245</span>, -<span style="color: #4e3163;">1</span><span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">=&gt; 1240</span>
<span style="color: #3a81c3;">round</span><span style="color: #3a81c3;">(</span><span style="color: #4e3163;">1275</span>, -<span style="color: #4e3163;">1</span><span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">=&gt; 1280</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org069fc64" class="outline-3">
<h3 id="org069fc64"><span class="section-number-3">3.2</span> Decimal</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">from</span> decimal <span style="color: #3a81c3; font-weight: bold;">import</span> Decimal, localcontext
<span style="color: #715ab1;">a</span> = Decimal<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'6.32'</span><span style="color: #3a81c3;">)</span>
<span style="color: #715ab1;">b</span> = Decimal<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'2.41'</span><span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3; font-weight: bold;">with</span> localcontext<span style="color: #3a81c3;">()</span> <span style="color: #3a81c3; font-weight: bold;">as</span> ctx:
    <span style="color: #715ab1;">ctx.prec</span> = <span style="color: #4e3163;">5</span>
    <span style="color: #3a81c3; font-weight: bold;">print</span><span style="color: #3a81c3;">(</span>a/b<span style="color: #3a81c3;">)</span> <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">2.6224</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org985d77f" class="outline-3">
<h3 id="org985d77f"><span class="section-number-3">3.3</span> Formatting</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">x</span> = <span style="color: #4e3163;">1234</span>.<span style="color: #4e3163;">56789</span>
<span style="color: #3a81c3;">format</span><span style="color: #3a81c3;">(</span>x, <span style="color: #2d9574;">'0.2f'</span><span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">=&gt; '1234.57'   # round</span>
<span style="color: #3a81c3;">format</span><span style="color: #3a81c3;">(</span>x, <span style="color: #2d9574;">'&gt;10.1f'</span><span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">=&gt; '    1234.6'</span>
<span style="color: #3a81c3;">format</span><span style="color: #3a81c3;">(</span>x, <span style="color: #2d9574;">'0,.1f'</span><span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">=&gt; '1,234.6</span>

<span style="color: #715ab1;">x</span> = <span style="color: #4e3163;">1234</span>
<span style="color: #3a81c3;">bin</span><span style="color: #3a81c3;">(</span>x<span style="color: #3a81c3;">)</span>  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">others: oct, hex</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">=&gt; '0b10011010010'</span>
<span style="color: #3a81c3;">format</span><span style="color: #3a81c3;">(</span>x, <span style="color: #2d9574;">'b'</span><span style="color: #3a81c3;">)</span>  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">others: o, x</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">=&gt; '0011010010'</span>
<span style="color: #3a81c3;">int</span><span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'10011010010'</span>, <span style="color: #4e3163;">2</span><span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">=&gt; 1234</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org348f7f0" class="outline-3">
<h3 id="org348f7f0"><span class="section-number-3">3.4</span> bytes-int conversion</h3>
<div class="outline-text-3" id="text-3-4">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">data</span> = b<span style="color: #2d9574;">'\x00\x124V\x00x\x90\xab\x00\xcd\xef\x01\x00#\x004'</span>
<span style="color: #715ab1;">x</span> = <span style="color: #3a81c3;">int</span>.from_bytes<span style="color: #3a81c3;">(</span>data, <span style="color: #2d9574;">'little'</span><span style="color: #3a81c3;">)</span> <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">or 'big'</span>
x.to_bytes<span style="color: #3a81c3;">(</span><span style="color: #4e3163;">16</span>, <span style="color: #2d9574;">'little'</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
<p>
useful in cryptography or networking domains
</p>
</div>
</div>

<div id="outline-container-org9b4ae02" class="outline-3">
<h3 id="org9b4ae02"><span class="section-number-3">3.5</span> cmath for complex math</h3>
</div>
<div id="outline-container-org52493f1" class="outline-3">
<h3 id="org52493f1"><span class="section-number-3">3.6</span> fractions for fraction calculation</h3>
</div>
<div id="outline-container-org60f499e" class="outline-3">
<h3 id="org60f499e"><span class="section-number-3">3.7</span> random</h3>
<div class="outline-text-3" id="text-3-7">
<ul class="org-ul">
<li><code>random.choice</code></li>
<li><code>random.sample</code></li>
<li><code>random.shuffle</code></li>
<li><code>random.randint</code></li>
<li><code>random.random</code>: 0 to 1</li>
<li><code>random.getrandbits</code></li>
</ul>
</div>
<div id="outline-container-org292a772" class="outline-4">
<h4 id="org292a772"><span class="section-number-4">3.7.1</span> seed</h4>
<div class="outline-text-4" id="text-3-7-1">
<div class="org-src-container">
<pre class="src src-python">random.seed<span style="color: #3a81c3;">()</span>  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Seed based on system time or os.urandom()</span>
random.seed<span style="color: #3a81c3;">(</span><span style="color: #4e3163;">12345</span><span style="color: #3a81c3;">)</span>  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Seed based on integer given</span>
random.seed<span style="color: #3a81c3;">(</span>b<span style="color: #2d9574;">'bytedata'</span><span style="color: #3a81c3;">)</span>  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Seed based on byte data</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3545030" class="outline-4">
<h4 id="org3545030"><span class="section-number-4">3.7.2</span> distribution</h4>
<div class="outline-text-4" id="text-3-7-2">
<ul class="org-ul">
<li><code>random.uniform</code></li>
<li><code>random.gauss</code></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgbb5f1ad" class="outline-3">
<h3 id="orgbb5f1ad"><span class="section-number-3">3.8</span> math.f***</h3>
<div class="outline-text-3" id="text-3-8">
<ul class="org-ul">
<li><code>math.fsum</code></li>
<li><code>math.fmod</code></li>
<li><code>math.fabs</code></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgd44ee8e" class="outline-2">
<h2 id="orgd44ee8e"><span class="section-number-2">4</span> Datetime</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org1b972d2" class="outline-3">
<h3 id="org1b972d2"><span class="section-number-3">4.1</span> Finding Last Friday</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">from</span> dateutil.relativedelta <span style="color: #3a81c3; font-weight: bold;">import</span> relativedelta
<span style="color: #3a81c3; font-weight: bold;">from</span> dateutil.rrule <span style="color: #3a81c3; font-weight: bold;">import</span> FR
<span style="color: #715ab1;">d</span> = datetime.now<span style="color: #3a81c3;">()</span>
<span style="color: #3a81c3; font-weight: bold;">print</span><span style="color: #3a81c3;">(</span>d + relativedelta<span style="color: #6c3163;">(</span>weekday=FR<span style="color: #2d9574;">(</span>-<span style="color: #4e3163;">1</span><span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>
