org/python/cookbook.org
** Timezone
   #+BEGIN_SRC python
     import pytz
     d = datetime.now() # no timezone info
     print(d)
     # => 2018-12-21 17:14:01.258941

     shanghai = pytz.timezone('Asia/Shanghai')
     loc_d = shanghai.localize(d) # Localize the date for Shanghai
     print(loc_d)
     # => 2018-12-21 17:14:01.258941+08:00

     # Once the date has been localized, it can be converted to other time zones
     utc_d = loc_d.astimezone(pytz.utc)
     print(utc_d)
     # => 2018-12-21 09:14:01.258941+00:00
   #+END_SRC

* Iterator
** Manually Consuming an Iterator
   #+BEGIN_SRC python
     iterable = iter(range(5))  # Invokes range.__iter__()
     try:
         while True:
             line = next(iterable)  # Invokes iterable.__next__()
             print(line, end='')
     except StopIteration:
         pass

     # non exception version
     while True:
         line = next(iterable, None)
         if line is None:
             break
         print(line, end='')
   #+END_SRC
