python/cookbook.html

<div id="outline-container-orgf7a5fa4" class="outline-3">
<h3 id="orgf7a5fa4"><span class="section-number-3">4.2</span> Timezone</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #3a81c3; font-weight: bold;">import</span> pytz
<span style="color: #715ab1;">d</span> = datetime.now<span style="color: #3a81c3;">()</span> <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">no timezone info</span>
<span style="color: #3a81c3; font-weight: bold;">print</span><span style="color: #3a81c3;">(</span>d<span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">=&gt; 2018-12-21 17:14:01.258941</span>

<span style="color: #715ab1;">shanghai</span> = pytz.timezone<span style="color: #3a81c3;">(</span><span style="color: #2d9574;">'Asia/Shanghai'</span><span style="color: #3a81c3;">)</span>
<span style="color: #715ab1;">loc_d</span> = shanghai.localize<span style="color: #3a81c3;">(</span>d<span style="color: #3a81c3;">)</span> <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Localize the date for Shanghai</span>
<span style="color: #3a81c3; font-weight: bold;">print</span><span style="color: #3a81c3;">(</span>loc_d<span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">=&gt; 2018-12-21 17:14:01.258941+08:00</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Once the date has been localized, it can be converted to other time zones</span>
<span style="color: #715ab1;">utc_d</span> = loc_d.astimezone<span style="color: #3a81c3;">(</span>pytz.utc<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3; font-weight: bold;">print</span><span style="color: #3a81c3;">(</span>utc_d<span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">=&gt; 2018-12-21 09:14:01.258941+00:00</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd31aa21" class="outline-2">
<h2 id="orgd31aa21"><span class="section-number-2">5</span> Iterator</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org12afd61" class="outline-3">
<h3 id="org12afd61"><span class="section-number-3">5.1</span> Manually Consuming an Iterator</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #715ab1;">iterable</span> = <span style="color: #3a81c3;">iter</span><span style="color: #3a81c3;">(</span><span style="color: #3a81c3;">range</span><span style="color: #6c3163;">(</span><span style="color: #4e3163;">5</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Invokes range.__iter__()</span>
<span style="color: #3a81c3; font-weight: bold;">try</span>:
    <span style="color: #3a81c3; font-weight: bold;">while</span> <span style="color: #4e3163;">True</span>:
        <span style="color: #715ab1;">line</span> = <span style="color: #3a81c3;">next</span><span style="color: #3a81c3;">(</span>iterable<span style="color: #3a81c3;">)</span>  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Invokes iterable.__next__()</span>
        <span style="color: #3a81c3; font-weight: bold;">print</span><span style="color: #3a81c3;">(</span>line, end=<span style="color: #2d9574;">''</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3; font-weight: bold;">except</span> <span style="color: #ba2f59; font-weight: bold;">StopIteration</span>:
    <span style="color: #3a81c3; font-weight: bold;">pass</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">non exception version</span>
<span style="color: #3a81c3; font-weight: bold;">while</span> <span style="color: #4e3163;">True</span>:
    <span style="color: #715ab1;">line</span> = <span style="color: #3a81c3;">next</span><span style="color: #3a81c3;">(</span>iterable, <span style="color: #4e3163;">None</span><span style="color: #3a81c3;">)</span>
    <span style="color: #3a81c3; font-weight: bold;">if</span> line <span style="color: #3a81c3; font-weight: bold;">is</span> <span style="color: #4e3163;">None</span>:
        <span style="color: #3a81c3; font-weight: bold;">break</span>
    <span style="color: #3a81c3; font-weight: bold;">print</span><span style="color: #3a81c3;">(</span>line, end=<span style="color: #2d9574;">''</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
